{
    "Friend": [
        "Wishing you a Christmas filled with laughter and joy, dear friend. May your holidays sparkle with moments of love and happiness!",
        "Friends like you make the season bright. Merry Christmas with all my heart!",
        "To a special friend, may your Christmas be merry and your New Year be bright!",
        "Cheers to the wonderful friendship we share! Wishing you a delightful Christmas!",
        "May your Christmas be wrapped in happiness and tied with love. Happy Holidays, my friend!"
    ],
    "Family": [
        "To my wonderful family, may our home be filled with love and our hearts with joy this Christmas.",
        "Merry Christmas to my family, the greatest gift of all. Love and joy to you all.",
        "Family is the true spirit of Christmas, and you make mine complete. Warm wishes to you!",
        "Blessed to spend another Christmas with the most precious family. Love you all!",
        "May our family Christmas be filled with laughter, love, and cheer. Merry Christmas!"
    ],
    "Funny": [
        "This Christmas, may your family be functional and all your batteries be included. Merry Christmas!",
        "Remember, Santa is watching. It’s not too late to be good…or at least good at pretending!",
        "Eat. Drink. Be Merry. Have a wonderfully overindulgent Christmas!",
        "May your Christmas be filled with joyful noise and lots of presents. But mostly presents.",
        "This year, I decided to put mistletoe in my back pocket so all the people I don’t like can kiss my…"
    ],
    "Sarcastic": [
        "Ah, Christmas: A time for joy, love, and pretending to like the gifts. Enjoy!",
        "Merry Christmas! Here’s to a day of awkward family interactions and overeating.",
        "Ho Ho Hope you find more happiness this Christmas than in the Christmas bonus you didn’t get.",
        "Wishing you a Merry Christmas and a ‘new year, new me’ that actually lasts.",
        "Christmas: the only time of year you can sit in front of a dead tree eating candy out of socks. Enjoy!"
    ]
}